{
  "projects": [
    {
      "name": "Planter",
      "slug": "planter",
      "type": "Contract",
      "client": "Genia",
      "tools": [
        "next.js",
        "prisma",
        "docker",
        "redux toolkit",
        "typescript",
        "apollo",
        "graphQL",
        "styled-components",
        "azure",
        "mui"
      ],
      "description": "Planter generates personalized gardening calendars for New Zealanders. With a database of over 50 plants, users can add their fruits and veggies to a cart and get information on optimizing growth based on their location (microclimate) and season.  Upon submission, users receive sow-to-harvest timelines as a stylized PDF sent via email.",
      "liveURL": "https://planter.co.nz/"
    },
    {
      "name": "Stellargaze",
      "slug": "stellargaze",
      "type": "Personal Project",
      "tools": [
        "react",
        "javascript",
        "googleapis",
        "styled-components",
        "mui",
        "express",
        "node",
        "mySQL",
        "passport.js",
        "openweather",
        "openstreetmaps"
      ],
      "description": "STELLARGAZE, my first Full Stack React web app, utilizes real-time data on moon phase, light pollution, and weather forecasts to rank a user's nearby public areas by it's stargazing visibility.",
      "liveURL": "https://stellargaze.com/"
    },
    {
      "name": "Trelli",
      "type": "Contract",
      "client": "Genia",
      "slug": "trelli",
      "tools": [
        "react",
        "vercel",
        "typescript",
        "react-spring",
        "styled-components",
        "mui",
        "koa",
        "node",
        "sendgrid",
        "azure"
      ],
      "description": "Trelli, winner of the Genia Innovation Award, simplifies custom orders for trellis, gates, and panels. Users input dimensions and design preferences. Upon submission, the backend calculates pricing, generates spec sheets, and distributes PDFs via email to sales, manufacturing teams, and the customer.",
      "liveURL": "https://trelli.co.nz/"
    },
    {
      "name": "Agora Mentoring",
      "type": "Contract",
      "client": "Agora",
      "slug": "agora",
      "tools": [
        "next.js",
        "vercel",
        "typescript",
        "prisma",
        "postgreSQL",
        "googleapis",
        "google-calendar",
        "redux toolkit",
        "apollo",
        "graphQL",
        "styled-components",
        "mui"
      ],
      "description": "AGORA streamlines mentorship connections. Users register as Mentors or Mentees, sharing work and education backgrounds. Mentees request mentors based on match ratings, supported by PostgreSQL, Prisma, Next.js, and data science tools. Upon acceptance, Google Meet links are automatically shared. I developed AGORA Mentoring myself, handling both front end and back end."
    },
    {
      "name": "Handits",
      "type": "School",
      "slug": "handits",
      "client": "Capstone - McMaster University",
      "tools": ["unity", "c#"],
      "description": "Handits is a 4-player puzzle/platformer game developed as a final-year Computer Science capstone project at McMaster University. Using Unity and C# scripts, players control bandits with versatile hands to grab, navigate dangerous terrain, and solve puzzles.  It involved game design principles, continuous playtesting, and Scrum methodology."
    }
  ]
}
